package kurs_1;

public class lesson2overtask1 {
    public static void main(String[] args) {
//        Задание 1.
//        Напишите программу, которая вычисляет квадрат любого числа.
        int i=3;
        int i2;
        double e=2.7182818284590452;
        double e2;
        System.out.println("Квадрат числа\t"+ i +"\tравен "+(i*i)+"\nКвадрат числа\t"+ e +"\t="+(e*e));
//        System.out.println("\nКвадрат числа\t"+ e +"\tравен"+(e*e));
    }
}
