package kurs_1;

public class lesson2overtask4 {
    public static void main(String[] args) {
        //        Задание 4.
//        Написать программу вычисления объема параллелепипеда. Ниже приведен рекомендуемый вид экрана во время выполнения программы.
//        Вычисление объема параллелепипеда.
//            Объем: 337.50 куб.см.
    float a=9,b= 7.5F,h=5;
    float        V;
    V=a*b*h;
    System.out.println("Объем параллелепипеда c параметрами\n\tдлина (см) -> 9\n\tширина (см) -> 7.5\n\tвысота (см) -> 5\nравен: "+V+"куб.см.");

    }
}
