package kurs_1;

public class lesson2task3 {
    public static void main(String[] args) {
//        Задание 3
//        Используя IntelliJ IDEA, создайте проект.
//                Создайте три строковые переменные и присвойте им значения:
       String a= "\nмоя строка 1";
       String b= "\tмоя строка 2";
       String c= "\\моя строка 3";
//        Выведите значение каждой переменной на экран. Какие отличия вы увидели. Сделайте выводы.
        System.out.println(a);
        System.out.println(b);
        System.out.println(c);
    }
}
