package kurs_1;

public class lesson2overtask3 {
    public static void main(String[] args) {
        //        Задание 3.
//        Составьте  программу перевода температуры из градусов Цельсия в градусы Фаренгейта.
//        Формула для преобразования:
//        Fahrenheit = 1.8 * Celsius + 32,0.
        double Fahrenheit;
        double Celsius = 10;
        Fahrenheit=1.8*Celsius+32;
        System.out.println("Температура "+Celsius+"\u2103"+" равна "+Fahrenheit+"\u2109");

    }
}
