package kurs_1;

public class lesson2overtask2 {
    public static void main(String[] args) {
//
//Задание 2.
//        Напишите программу, которая вычисляет объём шара.
        double pi=3.141592653;
        double V;
        int R=12;
        System.out.println("Oбъём шара \nV=4πr^3/3="+(4*pi*R*R*R/3));
    }
}

