package kurs_1;

public class lesson2task2 {
    public static void main(String[] args) {
        double pi=3.141592653;
        double e=2.7182818284590452;
        double a, b;
        char q='\u03C0';
        a = pi;
        b = e;
        System.out.println(q+"="+a+"\nЗначение числа Эйлера = "+b);

    }
}
//Задание 2
//        Используя IntelliJ IDEA, создайте проект.
//        Дано значение числа pi, которое равно 3,141592653 и значение числа Эйлера е, которое равно 2,7182818284590452.
//        Создайте две переменные, присвойте им значения числа pi и числа е и выведите их на экран без потери точности.