package kurs_1;

public class lesson2overtask5 {
    public static void main(String[] args) {
    int M=120;      //        Масштаб карты (количество километров в одном сантиметре) -> 120
    double l=3.5;
    double D;    //        Расстояние между точками, изображающими населенные пункты (см) -> 3.5
        D=l*M;
    System.out.println("Расстояние между населенными пунктами "+ D +"км");
    }
}
//        Задание 5.
//        Написать программу вычисления расстояния между населенными пунктами, изображенными на карте.
//        Ниже приведен рекомендуемый вид экрана во время выполнения программы.
//        Вычисление расстояния между населенными пунктами.

//        Расстояние между населенными пунктами 420 км.